
## :x: Apply Failed

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707148925)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.alb.aws_s3_bucket.alb_log: Refreshing state... [id=bined-hasura-alb-log-bucket]
module.ecs.data.aws_iam_policy.ecs_task_execution_role_policy: Reading...
module.alb.data.aws_elb_service_account.main: Reading...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=bined-hasura-20230730144634945400000001]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role: Reading...
module.alb.data.aws_elb_service_account.main: Read complete after 0s [id=582318560864]
module.network.aws_vpc.this[0]: Refreshing state... [id=vpc-0a20ed93f94539036]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.ecs.module.ecs_task_execution_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_iam_policy.ecs_task_execution_role_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Read complete after 0s [id=3108874331]
module.network.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e49e03a5db24049b]
module.network.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02f2e05642c4a4f10]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-06e4b653ba82a0dbb]
module.network.aws_route_table.public[0]: Refreshing state... [id=rtb-0100ed7567dfa4692]
module.network.aws_default_route_table.default[0]: Refreshing state... [id=rtb-05c8ef1ecd42c0a1c]
module.security_groups.aws_security_group.ecs: Refreshing state... [id=sg-0ff51e5c4d89f1d35]
module.security_groups.aws_security_group.alb: Refreshing state... [id=sg-0ecb9e4d622873720]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-04e257e755c87b631]
module.security_groups.aws_security_group.bastion: Refreshing state... [id=sg-0f8380f49f5c0ad42]
module.security_groups.aws_security_group.rds: Refreshing state... [id=sg-083bcb1f25b19e7ec]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb4120b65c92a107]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0824e210311fe3361]
module.network.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04d47fac8f245bf03]
module.network.aws_subnet.database[0]: Refreshing state... [id=subnet-06e0f4cbee44e1b7e]
module.network.aws_subnet.database[1]: Refreshing state... [id=subnet-012d2f4ea363148d7]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0f0bc25f4fe692b9f]
module.security_groups.aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2400929530]
module.security_groups.aws_security_group_rule.rds_from_ecs: Refreshing state... [id=sgrule-3456404465]
module.security_groups.aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2433012620]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ff62e3874f25450b]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0970af91d0fee328c]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dc75306fafe9d656]
module.network.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0100ed7567dfa46921080289494]
module.network.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c5f41ee2056851dc]
module.network.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-02aab784abc51b12a]
module.network.aws_db_subnet_group.database[0]: Refreshing state... [id=bined-hasura]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e5ff3a153cc05fb7]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09c3069fee8860280]
module.network.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0dc82545eb07c4ac9]
module.alb.data.aws_iam_policy_document.alb_log: Reading...
module.alb.aws_s3_bucket_lifecycle_configuration.alb_log: Refreshing state... [id=bined-hasura-alb-log-bucket]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/bined-hasura/a741a29df068794d]
module.alb.data.aws_iam_policy_document.alb_log: Read complete after 0s [id=1370340032]
module.alb.aws_s3_bucket_policy.alb_log: Refreshing state... [id=bined-hasura-alb-log-bucket]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bb4120b65c92a1071080289494]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-XXIT2TPBBUOXASROCVIPQMOYO4]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2]
module.alb.aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/bined-hasura/a741a29df068794d/1648e0df2c74c4a2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "bined-hasura"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs.aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "bined-hasura"
      + tags_all = (known after apply)
    }

  # module.ecs.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bined-hasura"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bined-hasura"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/bined-hasura-alb-target-group/dd6db5e43b282fe2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ff51e5c4d89f1d35",
            ]
          + subnets          = [
              + "subnet-04e257e755c87b631",
              + "subnet-0f0bc25f4fe692b9f",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu    = 256
                  + memory = 512
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "bined-hasura"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.ecs.module.ecs_task_execution_role.aws_iam_policy.main will be created
  + resource "aws_iam_policy" "main" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-task-execution-role-name-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::110728338021:role/ecsTaskExecutionRole"
                    },
                  + {
                      + Action   = "ecs:ExecuteCommand"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::110728338021:role/ecsTaskExecutionRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ecs.module.ecs_task_execution_role.aws_iam_role.main will be created
  + resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution-role-name-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main will be created
  + resource "aws_iam_role_policy_attachment" "main" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-task-execution-role-name-dev"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
module.ecs.aws_ecs_cluster.ecs_cluster: Creating...
module.ecs.aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
module.ecs.module.ecs_task_execution_role.aws_iam_role.main: Creating...
module.ecs.module.ecs_task_execution_role.aws_iam_policy.main: Creating...
module.ecs.module.ecs_task_execution_role.aws_iam_policy.main: Creation complete after 1s [id=arn:aws:iam::761817748648:policy/ecs-task-execution-role-name-dev]
module.ecs.module.ecs_task_execution_role.aws_iam_role.main: Creation complete after 1s [id=ecs-task-execution-role-name-dev]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main: Creating...
module.ecs.aws_ecs_task_definition.ecs_task_definition: Creating...
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.main: Creation complete after 0s [id=ecs-task-execution-role-name-dev-20230730160610736800000001]
module.ecs.aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 2s [id=bined-hasura]
module.ecs.aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
module.ecs.aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:761817748648:cluster/bined-hasura]
╷
│ Error: creating ECS Task Definition (bined-hasura): ClientException: Container.name should not be null or empty.
│ 
│   with module.ecs.aws_ecs_task_definition.ecs_task_definition,
│   on modules/ecs/main.tf line 22, in resource "aws_ecs_task_definition" "ecs_task_definition":
│   22: resource "aws_ecs_task_definition" "ecs_task_definition" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"27d3ca029717fc0336a920a6f88b32dd1e77978a","Vars":{},"WorkflowName":"Terraform"} -->